# Brewfile for macOS Development Environment
# Usage: brew bundle install

# Taps (third-party repositories)
tap "homebrew/bundle"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# ==================== CLI TOOLS ====================

# Essential system tools
brew "curl"
brew "wget"
brew "git"
brew "openssh"
brew "gnupg"

# Modern replacements for Unix tools
brew "ripgrep"          # rg - fastest grep replacement
brew "fzf"              # fuzzy finder for everything
brew "fd"               # faster, user-friendly find replacement
brew "bat"              # cat with syntax highlighting and Git integration
brew "eza"              # modern ls replacement (successor to exa)
brew "dust"             # intuitive du replacement with tree view
brew "duf"              # better df with colors and graphs
brew "procs"            # modern ps replacement
brew "bottom"           # cross-platform system monitor (btop alternative)
brew "tree"             # directory tree display
brew "zoxide"           # smarter cd command with frecency
brew "mcfly"            # upgraded ctrl-r with neural network
brew "tldr"             # simplified man pages
brew "thefuck"          # corrects previous commands
brew "trash"            # safer rm command
brew "navi"             # interactive cheatsheet tool

# File processing & utilities
brew "jq"               # JSON processor
brew "yq"               # YAML processor
brew "fx"               # interactive JSON viewer
brew "httpie"           # user-friendly curl replacement
brew "hyperfine"        # command-line benchmarking
brew "lf"               # terminal file manager (Go-based)
brew "watch"            # run commands periodically

# Compression & archives
brew "p7zip"            # 7zip archiver

# Network tools
brew "wireshark"        # network analyzer (CLI)

# ==================== DEVELOPMENT TOOLS ====================

# Text editors & terminal
brew "vim"              # text editor
brew "neovim"           # modern vim
brew "tmux"             # terminal multiplexer

# Version control
brew "gh"               # GitHub CLI
brew "delta"            # better git diff

# Programming languages
brew "node"             # JavaScript runtime
brew "python@3.12"      # Python
brew "go"               # Go language

# Package managers
brew "nvm"              # Node version manager (alternative to manual install)
# Note: pyenv and rbenv installed via script for better integration

# ==================== DATABASES ====================
brew "libpq"            # PostgreSQL client library and tools (psql)
brew "sqlite"           # SQLite database

# ==================== DEVOPS & CLOUD ====================
brew "docker-compose"   # multi-container Docker apps
brew "kubernetes-cli"   # kubectl
brew "helm"             # Kubernetes package manager
brew "awscli"           # AWS CLI

# ==================== SYSTEM UTILITIES ====================
brew "mas"              # Mac App Store CLI
brew "stow"             # symlink farm manager (for dotfiles)

# ==================== GUI APPLICATIONS ====================

# Development environments & AI-Enhanced IDEs
cask "cursor"           # VS Code fork
cask "xcode"
cask "docker"           # Docker Desktop

# Terminals
cask "iterm2"           # Classic Mac terminal with advanced features
cask "warp"             # AI-integrated terminal with modern UX

# API tools
cask "insomnia"
cask "bruno"            # Open-source API client
brew "bruno-cli"        # Bruno CLI for CI/CD

# AI Development Tools & Extensions
# Note: GitHub Copilot, Cursor AI, and other AI tools are integrated within IDEs

# ==================== PRODUCTIVITY APPS ====================

# Launchers & productivity
cask "raycast"           # Modern launcher with AI integration and extensions

# Window management
cask "rectangle"         # Free window management

# System utilities
cask "alt-tab"            # Windows-style alt-tab

# ==================== BROWSERS ====================
cask "google-chrome"
cask "microsoft-edge"

# ==================== COMMUNICATION ====================
cask "slack"
cask "discord"
cask "zoom"

# ==================== PASSWORD MANAGERS & SECURITY ====================
cask "1password"         # Full-featured password manager with SSH key support
cask "1password-cli"     # 1Password command-line tool

# ==================== MEDIA & DESIGN ====================
cask "vlc"              # media player

# ==================== FONTS ====================
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-cascadia-code"
cask "font-source-code-pro"
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "font-roboto-mono-nerd-font"
cask "font-cascadia-mono"
cask "font-sf-mono"

# ==================== MAC APP STORE ====================
